[
  {
    "company": "Berkshire Hathaway Energy",
    "subHeader": "Leading AI-assisted engineering initiatives, prompt standards, and behavioral reliability efforts across Dekaflow and internal tooling.",
    "role": "Senior Full Stack Engineer — AI Systems Integration",
    "location": "Richmond, VA",
    "dates": "2025 – Present",
    "image": "/logos/BHELogo.png",
    "highlights": [
      "Led company-wide GitHub Copilot integration, defining prompting standards, guardrails, and safe-usage guidelines adopted by 100+ engineers.",
      "Taught prompt engineering workshops covering reproducibility, failure modes, structured prompting, and model behavior constraints.",
      "Designed behavioral evaluation methods and dashboards to measure reliability, drift, and regression in AI-assisted coding flows.",
      "Built system-level prompts and structured meta-prompts used across internal tools, reducing hallucinations and improving determinism.",
      "Performed behavioral incident triage, diagnosing drift or misalignment and implementing validated prompt-level mitigations.",
      "Championed transparent, accessible, and safety-conscious UX in AI-integrated interfaces."
    ]
  },
  {
    "company": "DanceCard",
    "subHeader": "Co-founded and led engineering for a social platform designed around meaningful human connection and safe interaction patterns.",
    "role": "Head React Native Developer & Co-Founder",
    "location": "Richmond, VA",
    "dates": "2024 – Present",
    "image": "/logos/DanceCardLogo.png",
    "highlights": [
      "Built a cross-platform mobile app with real-time chat, scheduling, and geolocation, applying behavior-aware UI design to ensure predictability.",
      "Developed a prompt-driven moderation helper to classify and flag content safely within Supabase constraints.",
      "Created a React web companion dashboard and Supabase backend with strict validation and user-safety principles.",
      "Ensured accessibility and consistent performance across iOS, Android, and web.",
      "Managed App Store and Play Store deployments with user trust and clarity at the forefront."
    ]
  },
  {
    "company": "Sauer Brands, Inc.",
    "subHeader": "Engineering lead for AI-assisted marketing, analytics, and content-management platforms.",
    "role": "Senior Full Stack Developer — LLM-Integrated Systems",
    "location": "Richmond, VA",
    "dates": "2021 – 2025",
    "image": "/logos/SauerLogo.jpg",
    "highlights": [
      "Built AI-assisted dashboards and workflow tools using React and Python, including summarization and classification modules.",
      "Authored structural meta-prompts tuned for reliability and constrained behavior across high-variability inputs.",
      "Designed and executed prompt experiments and A/B tests to measure drift, safety edge cases, and sensitivity.",
      "Built ingestion pipelines (Redis + Postgres) feeding LLMs with validated, safety-checked data sources.",
      "Created internal prompting standards and documentation guiding safe prompting practices across teams.",
      "Partnered with leadership to translate ethical requirements into prompt-layer guardrails and behavioral constraints.",
      "Led ADA compliance audits, ensuring accessible, human-centered interfaces across all platforms."
    ]
  },
  {
    "company": "Soar365",
    "subHeader": "Short-term contract improving accessibility, modernization, and long-term maintainability.",
    "role": "Front-End Engineer (Contract)",
    "location": "Richmond, VA",
    "dates": "Aug 2021 – Dec 2021",
    "image": "/logos/SoarLogo.jpg",
    "highlights": [
      "Conducted a full ADA/WCAG audit, resolving key accessibility issues across the main public site.",
      "Migrated the organization to a maintainable Wix-based platform to empower non-technical teams.",
      "Improved UX structures for clarity and broad accessibility.",
      "Trained internal staff on accessibility-minded content workflows."
    ]
  },
  {
    "company": "Talos IoT",
    "subHeader": "Developed ML-enhanced IoT interfaces that translated complex diagnostics into clear, actionable user experiences.",
    "role": "Full Stack Engineer — ML-Enhanced IoT Systems",
    "location": "Glen Allen, VA",
    "dates": "2021",
    "image": "/logos/TalosoLogo.jpg",
    "highlights": [
      "Developed real-time IoT dashboards using React, WebSockets, and Python for high-throughput telemetry.",
      "Integrated traditional ML anomaly detection into backend services for early-risk identification.",
      "Built evaluation pipelines measuring accuracy, drift, and false-positive rates.",
      "Translated ML outputs into interpretable insights for high-speed technician environments.",
      "Optimized performance across iOS and Android via React Native."
    ]
  },
  {
    "company": "Presence Learning",
    "subHeader": "Improved web systems and workflows supporting marketing, operational consistency, and reliability.",
    "role": "Front-End Web Developer",
    "location": "Remote",
    "dates": "2020 – 2021",
    "image": "/logos/PresenceLogo.png",
    "highlights": [
      "Modernized front-end templates, reducing inconsistency across marketing channels.",
      "Identified workflow risks and implemented mitigations to strengthen operational reliability.",
      "Enhanced mobile UX and accessibility through responsive UI improvements.",
      "Consolidated more than 10+ scattered email templates into a unified, maintainable master template."
    ]
  },
  {
    "company": "Kurb Media",
    "subHeader": "Delivered front-end experiences across web, social, and early AR interfaces.",
    "role": "Front-End Developer — Interactive & Emerging Tech",
    "location": "Remote",
    "dates": "2019 – 2020",
    "image": "/logos/KurbMediaLogo.jpg",
    "highlights": [
      "Built responsive interfaces for interactive media and client platforms in fast-turnaround cycles.",
      "Developed UI components for early augmented-reality glasses prototypes.",
      "Explored foundational ML and computer-vision concepts supporting AR interaction — the spark for later AI behavior work.",
      "Adapted rapidly to shifting stacks (React, Liquid, PHP), delivering consistent results under tight deadlines."
    ]
  },
  {
    "company": "Freelance",
    "subHeader": "Designed and built accessible, human-centered websites for authors, nonprofits, and small businesses.",
    "role": "Front-End Developer",
    "location": "Richmond, VA",
    "dates": "2017 – 2021",
    "image": "/logos/CS.png",
    "highlights": [
      "Built responsive, accessible websites using HTML, CSS, JavaScript, React, and WordPress.",
      "Created interactive tools such as property listings and donor-engagement features.",
      "Delivered UX-focused designs tailored to each client’s goals.",
      "Maintained long-term relationships with iterative enhancement and support.",
      "Ensured performance, cross-device compatibility, and accessibility across all projects."
    ]
  }
]
