{
  "Languages": [
  { 
    "name": "HTML", 
    "level": 5, 
    "years": 10, 
    "description": "Core language used across every role; built accessible, standards-compliant interfaces and responsive layouts for enterprise and consumer applications." 
  },
  { 
    "name": "CSS", 
    "level": 5, 
    "years": 10, 
    "description": "Expert in modern CSS, including Flexbox, Grid, and responsive design; consistently delivered pixel-perfect, cross-browser experiences." 
  },
  { 
    "name": "JavaScript", 
    "level": 5, 
    "years": 10, 
    "description": "Primary language throughout career; built scalable front-end applications, interactive campaigns, and enterprise dashboards used by tens of thousands of users." 
  },
  { 
    "name": "TypeScript", 
    "level": 5, 
    "years": 6, 
    "description": "Adopted in freelance projects and scaled at Kurb Media; became a core language at Sauer Brands (Duke’s Country, HTS) for building type-safe, enterprise-ready React/Next.js applications." 
  },
  { 
    "name": "Python", 
    "level": 5, 
    "years": 6, 
    "description": "Introduced at Kurb and scaled heavily at Talos IoT and Sauer Brands; developed automation scripts, custom reporting pipelines, and tools integrating Shopify API with legacy Oracle systems." 
  },
  { 
    "name": "PHP", 
    "level": 4, 
    "years": 8, 
    "description": "Built and maintained WordPress sites in freelance and Presence Learning roles; later applied to IoT firmware integrations and backend services at Talos IoT." 
  },
  { 
    "name": "Java", 
    "level": 4, 
    "years": 5, 
    "description": "Hands-on experience in freelance and at BHE GT&S, where Java powers the Dekaflow 2 platform for energy data management." 
  },
  { 
    "name": "C#", 
    "level": 3, 
    "years": 3, 
    "description": "Used at Talos IoT for firmware and device-level programming; developed features to make Guardian boards operational and secure." 
  },
  { 
    "name": "Node.js", 
    "level": 4, 
    "years": 6, 
    "description": "Applied across full-stack projects for RESTful APIs and microservices; leveraged in Talos IoT and enterprise integrations at Sauer Brands." 
  }
],
"Frameworks": [
{ 
  "name": "Next.js", 
  "level": 5, 
  "years": 3, 
  "description": "First adopted at Sauer Brands to leverage built-in navigation and server-side rendering for scalable marketing sites. Now used daily at BHE GT&S, where I architect and maintain enterprise-grade platforms with React, TypeScript, and Next.js." 
},
  { 
    "name": "React", 
    "level": 5, 
    "years": 8, 
    "description": "Primary framework throughout career; built everything from consumer campaigns to enterprise-grade platforms. Deep expertise in hooks, context, and component architecture. React is my go-to for building maintainable, scalable applications." 
  },
  { 
    "name": "React Native", 
    "level": 5, 
    "years": 4, 
    "description": "Developed DanceCard mobile app from scratch—designing architecture, building features, and integrating Supabase backend without templates. Skilled in Expo, push notifications, and app store deployment." 
  },
  { 
    "name": "Bootstrap", 
    "level": 5, 
    "years": 6, 
    "description": "Used extensively at Talos IoT, Kurb Media, and Sauer Brands for rapid prototyping and production-ready styling, ensuring consistent responsive design." 
  },
  { 
    "name": "Material-UI", 
    "level": 5, 
    "years": 6, 
    "description": "Introduced at Kurb and applied heavily at BHE GT&S for Dekaflow 2.0. Built advanced UIs with MUI DataGrid, theming, accessibility enhancements, and reusable component patterns." 
  },
  { 
    "name": "Tailwind CSS", 
    "level": 5, 
    "years": 2, 
    "description": "Implemented at Sauer Brands for Duke’s Country and HTS, delivering fast, utility-first styling workflows that accelerated project delivery." 
  },
  { 
    "name": "SASS", 
    "level": 4, 
    "years": 2, 
    "description": "Applied at Talos IoT and Kurb Media for advanced styling and modular CSS architecture. Though less used recently, I can quickly reapply expertise as needed." 
  }
],
"State Management": [
  { 
    "name": "Context API", 
    "level": 5, 
    "years": 4, 
    "description": "Adopted immediately after release and became my go-to for most projects. Used in nearly every application I’ve built in the last 4 years (except at BHE, which uses other solutions). Ideal for scalable, maintainable state sharing without external dependencies." 
  },
  { 
    "name": "Redux", 
    "level": 4, 
    "years": 5, 
    "description": "Applied in large-scale apps requiring complex global state management. Implemented for HTS at Sauer Brands and across Talos IoT projects where multiple data sources and heavy interactions required robust structure." 
  },
  { 
    "name": "Jotai", 
    "level": 5, 
    "years": 1, 
    "description": "Explored and applied at BHE GT&S; appreciated for its lightweight atom-based approach to state management. Provides React-friendly simplicity while avoiding Redux boilerplate." 
  }
],
 "Infrastructure & DevOps": [
  { 
    "name": "Docker", 
    "level": 4, 
    "years": 1, 
    "description": "Introduced at Talos IoT and expanded at BHE GT&S, where I now write and maintain Dockerfiles daily for Dekaflow services. Skilled in containerization, image optimization, and multi-environment builds." 
  },
  { 
    "name": "Linux", 
    "level": 4, 
    "years": 3, 
    "description": "Primary development OS at Kurb Media, Talos IoT, and BHE GT&S. Experienced in shell scripting, package management, and using WSL as a daily coding environment on personal machines." 
  },
  { 
    "name": "AWS", 
    "level": 3, 
    "years": 2, 
    "description": "Deployed Guardian boards on AWS cloud services at Talos IoT and hosted early websites for Sauer Brands. Familiar with S3, EC2, and related deployment workflows." 
  },
  { 
    "name": "AWS Lambda", 
    "level": 3, 
    "years": 2, 
    "description": "Developed serverless functions for Talos IoT to support IoT event pipelines, and built smaller automation workflows at Sauer Brands." 
  },
  { 
    "name": "Cloudflare", 
    "level": 4, 
    "years": 4, 
    "description": "Use Cloudflare Pages and Workers extensively for personal projects and professional sites. Manage DNS, domains, and automated GitHub builds. This site itself is hosted on Cloudflare Pages." 
  },
  { 
    "name": "Azure", 
    "level": 4, 
    "years": 2, 
    "description": "Applied at Sauer Brands and BHE GT&S for hosting, repositories, CI/CD pipelines, and sprint task boards. Experienced with Azure DevOps workflows in enterprise environments." 
  },
  { 
  "name": "Trello", 
  "level": 5, 
  "years": 5, 
  "description": "Used across freelance and team projects for agile task management and sprint planning. Experienced in creating workflows, boards, and cross-team collaboration." 
}

],
 "Development Tools": [
  { 
    "name": "Git", 
    "level": 5, 
    "years": 10, 
    "description": "Used daily for version control and collaboration across every project. Experienced with branching strategies, pull requests, and code reviews in enterprise and open-source environments." 
  },
  { 
    "name": "npm", 
    "level": 5, 
    "years": 10, 
    "description": "Primary package manager for Node.js projects. Daily use for dependency management, custom scripts, and monorepo workflows." 
  },
  { 
    "name": "Postman", 
    "level": 5, 
    "years": 6, 
    "description": "Core tool for designing, testing, and documenting APIs. Used to debug endpoints and streamline integrations across projects at Talos IoT, Sauer Brands, and BHE GT&S." 
  },
  { 
    "name": "Swagger/OpenAPI", 
    "level": 5, 
    "years": 5, 
    "description": "Experienced in generating, maintaining, and consuming API documentation. Ensured alignment between frontend and backend teams with auto-generated schemas and validations." 
  },
  { 
    "name": "VSCode", 
    "level": 5, 
    "years": 6, 
    "description": "Daily development environment for all major projects. Customized with extensions for React, TypeScript, linting, testing, and accessibility compliance." 
  },
  { 
    "name": "Bash", 
    "level": 4, 
    "years": 6, 
    "description": "Applied for scripting, automation, and environment setup on Linux and WSL. Comfortable with shell scripting for DevOps tasks and developer workflows." 
  }
],
  "Data & API": [
  { 
    "name": "MongoDB", 
    "level": 4, 
    "years": 3, 
    "description": "Applied at BHE GT&S for new database systems and previously at Talos IoT. Experienced with schema design, querying, and integrating MongoDB into enterprise applications." 
  },
  { 
    "name": "SQL Server", 
    "level": 3, 
    "years": 3, 
    "description": "Hands-on with SQL Server at BHE GT&S, managing relational data models and writing queries to support enterprise energy applications." 
  },
  { 
    "name": "MySQL", 
    "level": 4, 
    "years": 5, 
    "description": "Implemented at Sauer Brands for marketing platforms and reporting dashboards, with additional SQL experience applied in enterprise environments at BHE." 
  },
  { 
    "name": "Supabase", 
    "level": 5, 
    "years": 4, 
    "description": "Go-to backend-as-a-service for personal and professional projects. Used at Sauer Brands for one-off campaign backends and extensively in personal apps like DanceCard for authentication, APIs, and real-time data." 
  },
  { 
    "name": "PostgreSQL", 
    "level": 4, 
    "years": 5, 
    "description": "Core relational database experience tied to Supabase. Skilled at writing SQL scripts, designing schemas, and managing migrations to support scalable applications." 
  }
],

"Mobile Deployment & Monitoring": [
  { 
    "name": "Expo", 
    "level": 5, 
    "years": 4, 
    "description": "Core framework used to build and deploy mobile apps like DanceCard and HTS. Experienced with Expo CLI, configuration, and integrations for push notifications and OTA updates." 
  },
  { 
    "name": "OTA Updates", 
    "level": 4, 
    "years": 4, 
    "description": "Delivered seamless over-the-air updates to DanceCard users via Expo, enabling quick fixes and feature releases without requiring app store resubmissions." 
  },
  { 
    "name": "App Store Publishing", 
    "level": 5, 
    "years": 4, 
    "description": "Published DanceCard and HTS apps to the Apple App Store. Skilled with certificates, provisioning profiles, and the TestFlight pipeline for beta testing." 
  },
  { 
    "name": "Google Play Publishing", 
    "level": 5, 
    "years": 4, 
    "description": "Released and maintained DanceCard and HTS apps on Google Play. Familiar with Play Console policies, deployment tracks, and release management." 
  },
  { 
    "name": "Firebase Crashlytics", 
    "level": 4, 
    "years": 4, 
    "description": "Integrated with DanceCard to track crashes, analyze stability, and prioritize bug fixes based on real-world user impact." 
  },
  { 
    "name": "Sentry", 
    "level": 4, 
    "years": 4, 
    "description": "Used for monitoring and error reporting in DanceCard and HTS. Configured Sentry to capture logs and exceptions for faster debugging and improved app reliability." 
  }
],

"Testing & QA": [
  { 
    "name": "Test-Driven Development (TDD)", 
    "level": 4, 
    "years": 5, 
    "description": "Applied TDD principles across professional projects to ensure reliability and maintainability. Experienced in writing tests first to guide implementation and prevent regressions." 
  },
  { 
    "name": "Jest", 
    "level": 5, 
    "years": 5, 
    "description": "Write Jest unit tests for every professional file I develop, ensuring robust coverage from the start. Skilled in mocking, snapshot testing, and asynchronous test handling." 
  },
  { 
    "name": "Integration Testing", 
    "level": 4, 
    "years": 5, 
    "description": "Experienced in verifying system-level workflows across APIs, databases, and front-end integrations. Applied consistently in enterprise projects to validate real-world user flows." 
  }
],

 "IoT & Firmware": [
  { 
    "name": "Embedded Firmware", 
    "level": 3, 
    "years": 1, 
    "description": "Developed firmware for Guardian boards at Talos IoT, where writing code to control hardware devices felt like magic. Gained hands-on experience bridging software and hardware systems." 
  },
  { 
    "name": "Real-time Sensor Data Pipelines", 
    "level": 3, 
    "years": 1, 
    "description": "Built real-time pipelines at Talos IoT to process and transmit sensor data from Guardian boards. Though not a daily focus in other roles, I enjoyed the challenge and would eagerly apply it again." 
  }
],
"Data Visualization & Monitoring": [
  { 
    "name": "Grafana", 
    "level": 4, 
    "years": 5, 
    "description": "Built and maintained dashboards at Talos IoT using Grafana as the core visualization platform. Continue to use Grafana with Supabase for monitoring applications like DanceCard and this portfolio site, tracking real-time metrics and system health." 
  }
],

"Accessibility & Standards": [
  { 
    "name": "WCAG 2.1", 
    "level": 5, 
    "years": 6, 
    "description": "Applied WCAG 2.1 guidelines across projects from freelance work to Sauer Brands and Soar 365. Conduct audits and implement changes to ensure digital experiences meet or exceed accessibility standards." 
  },
  { 
    "name": "ADA Compliance", 
    "level": 5, 
    "years": 6, 
    "description": "Deeply experienced in aligning applications with ADA requirements, particularly at Sauer Brands where compliance was a core priority. Advocate for inclusive design so all users can engage with digital products." 
  },
  { 
    "name": "Semantic HTML", 
    "level": 5, 
    "years": 6, 
    "description": "Emphasize clean, semantic HTML in every project to improve accessibility, SEO, and long-term maintainability. Standard practice since freelance days and reinforced through enterprise work." 
  },
  { 
    "name": "Color Contrast Audits", 
    "level": 5, 
    "years": 6, 
    "description": "Perform regular audits to verify compliance with contrast ratios, ensuring readability for users with low vision. At Kurb and Sauer Brands, led efforts to adapt branding palettes while maintaining accessibility." 
  },
  { 
    "name": "Screen Reader Testing", 
    "level": 4, 
    "years": 6, 
    "description": "Hands-on testing with NVDA and VoiceOver to validate site accessibility for screen reader users. Applied at Soar 365 and Sauer Brands to ensure real-world usability, not just box-check compliance." 
  }
]
}
