[
  {
  "title": "Chat Assistant",
  "description": "A safety-focused conversational assistant designed for my personal website, built to explore structured intent handling, controlled model outputs, and responsible LLM feature integration.",
  "businessImpact": "Serves as a practical demonstration of AI-assisted UX that prioritizes user trust, predictable behavior, and guardrail-driven interactions—aligned with modern AI safety principles.",
  "highlights": [
    "Built an intent-routing system that categorizes queries into safe, deterministic workflows before calling any model.",
    "Designed guardrails and fallback responses to avoid unsafe or ambiguous model behavior.",
    "Implemented reasoning-chain compression techniques to ensure concise, stable answers without exposing internal system prompts.",
    "Added structured memory (context windows, state machines) to support multi-step interactions while avoiding unintended persistence.",
    "Currently extending the system with Anthropic-style 'constitutional' rules for tone, safety, and clarity."
  ],
  "technologies": ["React", "Next.js", "TypeScript", "Python", "LLM APIs", "Prompt Engineering"],
  "image": "/projectImages/Chatbot.png"
},

  {
    "title": "Dekaflow 2",
    "description": "A next-generation energy management platform for Berkshire Hathaway Energy, designed to deliver predictable, accessible, and high-reliability workflows across multiple internal teams.",
    "businessImpact": "Improved system consistency and accessibility while shaping coding standards, AI-assisted development patterns, and reliable front-end architecture for a mission-critical enterprise product.",
    "highlights": [
      "Reviewed PRs and contributed scalable React + TypeScript code aligned with predictable behavior patterns.",
      "Developed early prompting guidelines for Copilot to reduce ambiguity, improve determinism, and avoid common failure modes in AI-assisted workflows.",
      "Collaborated across engineering, design, and QA to ensure UI behavior stayed consistent under a variety of edge cases.",
      "Helped document repeatable reasoning workflows for debugging and code review."
    ],
    "technologies": ["React", "TypeScript", "Next.js", "Material-UI", "Jotai", "Azure DevOps"],
    "image": "/projectImages/BHE.png"
  },

  {
    "title": "PurrQuest",
    "description": "A location-aware mobile app for tracking outdoor and stray cats. Built to demonstrate clean state management, schema clarity, and geolocation reliability.",
    "businessImpact": "Showcases geospatial data modeling, safe image uploads, and deterministic rendering across devices—useful foundations for reliability-focused development.",
    "highlights": [
      "Integrated Google Maps API with clear separation of concerns between location, image, and metadata layers.",
      "Designed schema that avoids ambiguous states and ensures deterministic pin behavior.",
      "Implemented secure photo uploads using Supabase policies and Edge Functions.",
      "Explored future LLM-driven features such as automatic tagging and encounter summaries."
    ],
    "technologies": ["React Native", "TypeScript", "Google Maps API", "Supabase", "Supabase Edge Functions"],
    "image": "/projectImages/PurrQuest.png"
  },

  {
    "title": "DanceCard",
    "description": "A mobile-first social platform built to connect people through shared hobbies while prioritizing user safety, reliable scheduling, and predictable interaction flows.",
    "businessImpact": "Shipped a fully functional iOS/Android application with real-time chat, events, and recommendations while designing moderation-ready data structures.",
    "highlights": [
      "Implemented structured, real-time chat with predictable message ordering and safe rendering behaviors.",
      "Designed event scheduling and location-aware features with consistent timezone handling.",
      "Explored LLM-assisted moderation patterns for detecting unsafe content or edge-case behaviors.",
      "Built and deployed a companion web app and Supabase backend with secure authentication and RLS."
    ],
    "technologies": ["React Native", "React", "Supabase", "Expo", "PostgreSQL", "Sentry", "Firebase Crashlytics"],
    "image": "/projectImages/DanceCard.png"
  },

  {
    "title": "Duke’s Country",
    "description": "A React-based site supporting large national traffic events such as the Duke’s Mayo Bowl, with a content workflow designed for reliability and rapid updates.",
    "businessImpact": "Handled massive traffic surges and empowered non-technical teams through simple, predictable editing workflows.",
    "highlights": [
      "Built secure backend tools enabling marketing teams to update images, contests, and content reliably.",
      "Implemented caching and fail-safe rendering patterns for stability during high-traffic periods.",
      "Designed internal LLM-assisted helpers for drafting copy and categorizing content."
    ],
    "technologies": ["TypeScript", "React", "CSS", "Cloudflare Pages", "Supabase"],
    "image": "/projectImages/WTDC.png"
  },

  {
    "title": "Hot Tomato Summer",
    "description": "A multi-city restaurant voting platform engineered to scale while enforcing voting integrity through behavior-constraining systems.",
    "businessImpact": "Supported tens of thousands of voters across hundreds of restaurants while mitigating adversarial behavior.",
    "highlights": [
      "Designed rule-based fraud detection to identify suspicious activity and adversarial voting patterns.",
      "Built dashboards for restaurants to manage content and see analytics clearly.",
      "Implemented backend processes for safe authentication, user fingerprinting, and anomaly detection."
    ],
    "technologies": ["React", "Redux", "Supabase", "Python", "Authentication", "Fingerprinting"],
    "image": "/projectImages/HTS.png"
  },

  {
    "title": "Third Age Technology",
    "description": "A senior-focused technology support site designed with clarity, safety, and accessible design patterns for older adults.",
    "businessImpact": "Delivered a high-trust web experience by emphasizing predictable navigation, scam-awareness resources, and safety-first UX.",
    "highlights": [
      "Built a clean, accessible React + Vite interface with predictable layout behavior.",
      "Implemented secure Supabase form submissions with row-level security.",
      "Designed UX materials to help users avoid common scams and risky interactions.",
      "Deployed via Cloudflare Pages with SEO and accessibility audits."
    ],
    "technologies": ["React", "Vite", "Supabase", "Cloudflare Pages", "HTML5", "CSS3"],
    "image": "/logos/ThirdAgeTechnology.jpg"
  },

  {
    "title": "Kernel Season’s Sweepstakes",
    "description": "A reusable sweepstakes engine with dynamic schema generation and predictable behavior across campaigns.",
    "businessImpact": "Allowed marketing teams to generate sweepstakes independently while maintaining backend safety and consistency.",
    "highlights": [
      "Created dynamic table-generation logic to ensure schemas remained valid and unambiguous.",
      "Built admin dashboards for prize management and submission tracking.",
      "Designed architecture that protected against malformed configurations or unsafe states."
    ],
    "technologies": ["TypeScript", "Supabase", "Context API", "PostgreSQL", "Supabase Edge Functions"],
    "image": "/projectImages/KSSweep.png"
  },

  {
    "title": "Talos IoT",
    "description": "An IoT analytics system for HVAC diagnostics, combining hardware inputs with interpretable dashboards.",
    "businessImpact": "Improved predictive maintenance workflows by providing clear, interpretable indicators of system health.",
    "highlights": [
      "Built Grafana dashboards to visualize data in a reliable, human-readable format.",
      "Developed user interfaces enabling technicians to understand real-time device states.",
      "Contributed to embedded firmware design with attention to predictable communication patterns."
    ],
    "technologies": ["React", "React Native", "Grafana", "AWS", "Embedded Firmware", "C#", "Docker"],
    "image": "/projectImages/TalosIoT.png"
  },

  {
    "title": "Soar 365 Website",
    "description": "Accessibility remediation and redesign for a nonprofit serving individuals with disabilities.",
    "businessImpact": "Ensured compliance with WCAG guidelines and delivered a predictable, stable editing workflow for non-technical staff.",
    "highlights": [
      "Audited and remediated ADA issues across templates and components.",
      "Migrated the site to Wix to eliminate brittle code dependencies.",
      "Trained staff on safe, consistent content updates."
    ],
    "technologies": ["Wix", "Accessibility Audits", "WCAG 2.1", "Semantic HTML"],
    "image": "/projectImages/soar365.png"
  },

  {
    "title": "PresenceLearning Website",
    "description": "A modernized WordPress experience supporting digital therapy access for students.",
    "businessImpact": "Improved reliability and accessibility of a platform serving vulnerable student populations.",
    "highlights": [
      "Updated front-end templates for predictable responsive behavior.",
      "Simplified email workflows to reduce human error and template drift.",
      "Enhanced accessibility and performance through structured semantic markup."
    ],
    "technologies": ["PHP", "WordPress", "Bootstrap", "HTML", "CSS"],
    "image": "/projectImages/Presence.png"
  },

  {
    "title": "Sauer Brand Websites",
    "description": "A suite of Shopify brand sites with consistent theming, predictable content patterns, and accessibility improvements.",
    "businessImpact": "Provided stable public-facing sites with coherent branding and safe editing workflows.",
    "highlights": [
      "Implemented theme-level Liquid customizations with predictable structure.",
      "Collaborated closely with marketing teams to ensure accessible, brand-aligned layouts.",
      "Documented prompting techniques to safely support Copilot usage for repetitive tasks."
    ],
    "technologies": ["Shopify", "Liquid", "HTML", "CSS", "Accessibility"],
    "image": "/projectImages/SBLogoPNG.png"
  },

  {
    "title": "Sales Reporting Tool",
    "description": "A Python-based reporting pipeline replacing Shopify’s limited reporting system with deterministic nightly exports.",
    "businessImpact": "Ensured consistent, machine-validated data delivery into Oracle pipelines.",
    "highlights": [
      "Queried Shopify APIs and normalized data for reliable ingestion.",
      "Designed deterministic transforms to avoid ambiguity across runs.",
      "Automated delivery via email with guaranteed formatting."
    ],
    "technologies": ["Python", "Shopify API", "Oracle", "CSV Automation", "Backend Scripting"],
    "image": "/projectImages/SalesReporting.jpg"
  },

  {
    "title": "Blue Door Art Gallery",
    "description": "A clean, performance-first portfolio website showcasing fine art collections.",
    "businessImpact": "Delivered a predictable gallery system and clean admin workflow ensuring safe, simple updates.",
    "highlights": [
      "Built responsive layouts using CSS Grid and Flexbox for consistent rendering.",
      "Performed image optimization to maintain clarity without sacrificing load speed.",
      "Designed a non-technical editing workflow for easy updates."
    ],
    "technologies": ["Next.js", "React", "CSS Grid/Flexbox", "Cloudflare Pages"],
    "image": "/projectImages/OctopusGarden.jpg"
  },

  {
    "title": "Megan’s List",
    "description": "A structured book and wine tracking application built to demonstrate clean schema design and reliable filtering behavior.",
    "businessImpact": "Provided a personal data tool that showcases thoughtful database design and predictable UI patterns.",
    "highlights": [
      "Created a normalized schema supporting books, wines, ratings, and notes.",
      "Implemented Supabase auth and row-level security.",
      "Designed responsive components for reliable browsing and logging."
    ],
    "technologies": ["React", "Supabase", "PostgreSQL", "TypeScript", "Styled Components"],
    "image": "/projectImages/MegansList.jpg"
  },

  {
    "title": "Pick a Restaurant",
    "description": "A mobile restaurant recommendation system using a deterministic selection algorithm to avoid repetition bias.",
    "businessImpact": "Demonstrates practical algorithm design for user preferences, memory, and freshness of recommendations.",
    "highlights": [
      "Built a questionnaire-driven flow for narrowing restaurant options.",
      "Created a Supabase backend tracking visits, happy hours, and style categories.",
      "Designed logic to avoid stale outcomes and encourage variety.",
      "Packaged and deployed via Expo as an Android APK."
    ],
    "technologies": ["React Native", "Supabase", "Expo", "Context API", "Supabase Edge Functions"],
    "image": "/projectImages/PickRest.jpg"
  },

  {
    "title": "Wyrmspire D&D Website",
    "description": "A custom site for managing an original D&D campaign, built with structured lore modeling and interactive tools.",
    "businessImpact": "Highlights data modeling, narrative structuring, and reusable component design for a complex content system.",
    "highlights": [
      "Created structured schemas for characters, locations, and session recaps.",
      "Built modular UI components optimized for live-table use.",
      "Ensured predictable behavior during quick in-session reference."
    ],
    "technologies": ["React", "TypeScript", "Supabase", "CSS Modules"],
    "image": "/projectImages/WyrmSpire.png"
  },

  {
    "title": "Longrock Slot Machine",
    "description": "A themed slot-machine mini-game demonstrating probability design, animations, and controlled randomness.",
    "businessImpact": "Showcases clear logic modeling, animation timing, and safe randomization patterns.",
    "highlights": [
      "Implemented reel animations with predictable timing and physics.",
      "Designed controlled probability curves ensuring fair outcomes.",
      "Applied custom theming and CSS animations for an immersive feel."
    ],
    "technologies": ["React", "JavaScript", "CSS Animations"],
    "image": "/projectImages/CasinoLongRock.png"
  },

  {
    "title": "Wyrmspire Arm Wrestling Game",
    "description": "A lightweight physics-inspired arm wrestling mini-game using interaction patterns that simulate strength and struggle.",
    "businessImpact": "Demonstrates reliable input handling, performance-aware rendering, and fair gameplay mechanics.",
    "highlights": [
      "Created a competitive click/tap mechanic balancing player input with controlled randomness.",
      "Designed logic to prevent runaway outcomes or unfair advantages.",
      "Optimized for responsive, low-latency user feedback."
    ],
    "technologies": ["React", "JavaScript", "Canvas API", "CSS"],
    "image": "/projectImages/ArmWrestling.png"
  },

  {
    "title": "Change in Uzbekistan",
    "description": "A custom-built international client site created while at Kurb Media.",
    "businessImpact": "Demonstrates the ability to gather requirements, model content predictably, and deliver polished, accessible layouts.",
    "highlights": [
      "Collaborated directly with stakeholders to define clear requirements.",
      "Developed accessible layouts with consistent behavior across devices.",
      "Provided stable support during launch and iteration."
    ],
    "technologies": ["React", "HTML", "CSS", "Client Collaboration"],
    "image": "/projectImages/CUReforms.png"
  }
]
