[
  {
    "degree": "Doctor of Computer Science",
    "school": "National University",
    "dates": "2022 – 2026 (Expected)",
    "subHeader": "Dissertation: 'Evaluating the Security of AI-Generated Code: A Quantitative Study Using a Custom Scoring Framework'",
    "logo": "/logos/NationalLogo2.png",
    "highlights": [
      "Pursuing a Ph.D. focused on AI Safety, Alignment, and Model Reliability.",
      "Developing a hybrid vulnerability scoring framework combining OWASP, CVSS, and model-specific behavioral metrics.",
      "Researching how prompt design influences downstream system behavior, risk exposure, and model consistency.",
      "Conducting empirical evaluations of AI-generated code to identify failure modes, drift patterns, and exploit pathways.",
      "Building behavioral test harnesses to measure hallucination rates, determinism, and reliability under adversarial inputs.",
      "Translating ethical principles—transparency, fairness, non-manipulative UX—into actionable prompt-layer constraints.",
      "Expected graduation: June 2026"
    ]
  },
  {
    "degree": "Master of Science in Information Technology Management",
    "school": "Strayer University",
    "dates": "2020 – 2022",
    "subHeader": "4.0 GPA with coursework emphasizing Cybersecurity and Infrastructure",
    "logo": "/logos/StrayerUniversity.jpg",
    "highlights": [
      "Graduated with highest honors (4.0 GPA)",
      "Specialized coursework in Cybersecurity, Risk Management, and IT Infrastructure",
      "Capstone focused on IT Policy and Strategic Technology Management"
    ]
  },
  {
    "degree": "Bachelor of Science in Information Technology",
    "school": "Strayer University",
    "dates": "2017 – 2020",
    "subHeader": "4.0 GPA with coursework in Java, Web Development, and Software Engineering",
    "logo": "/logos/StrayerUniversity.jpg",
    "highlights": [
      "Graduated with 4.0 GPA",
      "Core coursework in Java programming, Web Development, and Database Systems",
      "Senior projects focused on full-stack application design"
    ]
  }
]
